public/programming/notes/start-projects.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<link rel="stylesheet" href="/giovanni-diary/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../../index.html">Giovanni's Diary</a> &gt; <a href="../../subjects.html">Subjects</a> &gt; <a href="../programming.html">Programming</a> &gt; <a href="notes.html">Notes</a> &gt;
</p>

<div id="outline-container-org4e2e398" class="outline-2">
<h2 id="org4e2e398">Start projects</h2>
<div class="outline-text-2" id="text-org4e2e398">
<p>
I can't stress this enough: if you want to learn to become a good
programmer / software engineer, start making projects. Lots of
them. Especially early in your career, you need to explore ideas and
get familiar with different and difficult concepts. The key is to play
with them and have fun.
</p>

<p>
To reiterate, I think the best way to become a good programmer is to
implement hard things yourself, from scratch. Yes, I know it requires
a huge effort, but that is exactly the point! And I think this holds
in general for most skills.
</p>

<p>
What to implement? Really anything that comes into your mind. However,
I think that there are some "core software" that everybody should be
able to implement themselves, including:
</p>

<ul class="org-ul">
<li>operating systems</li>
<li>compilers</li>
<li>databases</li>
<li>graphics renderers</li>
<li>codecs</li>
</ul>

<p>
If you aim to have a decent understanding of all the above and
implement a non-naive version of them, you would become a better
software developer.
</p>

<p>
I also feel like the education system should include and promote
projects, and applying the theoretical knowledge in actual
applications, focusing on the "core software" listed above.
</p>

<hr />

<p>
Travel: <a href="notes.html">Programming Notes</a>, <a href="../../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</body>
</html>
